[
  {
    "text": "TIL Stu, the IT guy from \"what we do in the shadows\", is in fact an IT guy named Stu in real life. He thought he was on set to help with IT related tasks and had no idea how big his part in the movie was until filming was almost wrapped",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3c4nx/til_stu_the_it_guy_from_what_we_do_in_the_shadows/"
  },
  {
    "text": "TIL About Horace De Vere Cole, an eccentric prankster who once gave out tickets to a theatrical performance to bald people so that when the light shone on their heads it would spell out \"bollocks\"",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3cedp/til_about_horace_de_vere_cole_an_eccentric/"
  },
  {
    "text": "TIL that in 2008 and at the age of 45, Flea, bass player of the multiplatinum rock band Red Hot Chili Peppers, enrolled as a freshman at University of Southern California's music program to learn the academic side of music.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3fe2g/til_that_in_2008_and_at_the_age_of_45_flea_bass/"
  },
  {
    "text": "TIL of Si Kaddour Benghabrit, the rector of the Great Mosque of Paris who helped over 500 Jews disguise themselves as Muslims by making the administrative staff grant them certificates of Muslim identity, which allowed them to avoid arrest and deportation.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3aefh/til_of_si_kaddour_benghabrit_the_rector_of_the/"
  },
  {
    "text": "TIL The Inuit Way to teach kids to control their anger by using story to discipline and not acting out.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3b4kr/til_the_inuit_way_to_teach_kids_to_control_their/"
  },
  {
    "text": "TIL 'US Radium' employed women to paint dials of watches with radioactive radium paint. The women were instructed to point their brushes on their lips. This led to many of the workers' losing their jaws and even deaths. Company paid examiners covered it up and claimed they had syphilis.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3cmxi/til_us_radium_employed_women_to_paint_dials_of/"
  },
  {
    "text": "TIL the Spanish Flu got its name during WWI. No one fighting in the war wanted to admit that thousands of their troops were dying to some fast spreading disease. However, Spain was neutral, so they reported on it, making people think they were the source.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3bkyq/til_the_spanish_flu_got_its_name_during_wwi_no/"
  },
  {
    "text": "TIL that Leslie David Baker, who played Stanley Hudson on the Office, was a teacher for special needs children before he was an actor.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3a9am/til_that_leslie_david_baker_who_played_stanley/"
  },
  {
    "text": "TIL When a poacher’s snare killed one of their own, two young gorillas teamed up to find and dismantle traps in their Rwandan forest home. They saw what they had to do, they did it then moved to dismantle next trap.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b36agy/til_when_a_poachers_snare_killed_one_of_their_own/"
  },
  {
    "text": "TIL John Quincy Adams would go skinny dipping in the Potomac River every morning. Anne Royall, the first female journalist to ever score an interview with a president, discovered Adams skinny dipping one morning and hid his clothing until he agreed to talk to her.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b35eoo/til_john_quincy_adams_would_go_skinny_dipping_in/"
  },
  {
    "text": "TIL that drinking beer reduces the chance of kidney stones among beverages the most (by 41%) while sugary colas increase the risk of kidney stones by 23%",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3dyvh/til_that_drinking_beer_reduces_the_chance_of/"
  },
  {
    "text": "TIL there is something called 'sovereign immunity', preventing Queen Elizabeth from law prosecution. In theory, she could get away with murder.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3fpva/til_there_is_something_called_sovereign_immunity/"
  },
  {
    "text": "TIL of Dr Richard Batista, who sued his wife to get back the kidney he donated to her, after she cheated on him.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b32jeb/til_of_dr_richard_batista_who_sued_his_wife_to/"
  },
  {
    "text": "TIL that of the 5000 or so species of mammals on the planet only female humans have permanent breasts.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b31w1l/til_that_of_the_5000_or_so_species_of_mammals_on/"
  },
  {
    "text": "TIL the U.S. Navy tried to remove a whale carcass with dynamite. A veteran with explosives training warned the amount of dynamite was far too much – advice that went unheeded. His brand-new car, purchased during a \"Get a Whale of a Deal\" promotion, was then flattened by a chunk of falling blubber.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b33bxg/til_the_us_navy_tried_to_remove_a_whale_carcass/"
  },
  {
    "text": "TIL Antony Hopkins composed a waltz in 1964 that was only released years later. The famous actor was afraid that nobody would like it and therefore never got to hear it being played up until 2011 thanks to André Rieu - a Dutch violinist who got sent the music sheets by Hopkins' wife.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b32mae/til_antony_hopkins_composed_a_waltz_in_1964_that/"
  },
  {
    "text": "TIL The Honas Wagner card; the most expensive baseball card in the world is so rare because it was sold by the 'American Tobacco Company'. Wagner was a non smoker and he threatened to seek legal action against ATC so they stopped producing it.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b327bh/til_the_honas_wagner_card_the_most_expensive/"
  },
  {
    "text": "TIL that Killian, a black labrador, saved a baby boy from an abusive babysitter by staying between the baby and the sitter and alerting the parents. Parents tried recording the scene, and the sitter was convicted.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b38gz9/til_that_killian_a_black_labrador_saved_a_baby/"
  },
  {
    "text": "TIL: that the Chinese government has an AI survelliance system that uses +20M cameras and facial recognition to track citizens behavior and monitor criminals. They officially named it: “Skynet” - because of Terminator...!",
    "link": "https://www.reddit.com/r/todayilearned/comments/b39721/til_that_the_chinese_government_has_an_ai/"
  },
  {
    "text": "TIL of Benjamin Lay, a radical abolitionist Quaker from 19th c. PA. He lived in a cave, ate only vegetables & fruit, & threatened slave-owning Quaker's with God's wrath. Also he was a hunchback dwarf.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3eqsi/til_of_benjamin_lay_a_radical_abolitionist_quaker/"
  },
  {
    "text": "TIL that both of Jon Hamm's parents passed away by the time he turned 20 and when he was 24 he moved to Los Angeles with nothing but his car and $150 to pursue acting.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b31kg2/til_that_both_of_jon_hamms_parents_passed_away_by/"
  },
  {
    "text": "TIL that to apply to become a communist party member in China, you need to write periodic \"thought reports\" for two years, detailing your opinions on society and about your personal life. Additionally you have to attend classes once a week for three months and pass a final exam.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3fpid/til_that_to_apply_to_become_a_communist_party/"
  },
  {
    "text": "TIL that people used to gather around paintings at well-to-do parties identifying hard-to-spot things for fun, a game that was essentially I Spy but for the wealthy and educated.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b30gtm/til_that_people_used_to_gather_around_paintings/"
  },
  {
    "text": "TIL That there is a Scottish nurse that can detect Parkinson's disease through smell with an accuracy of 91%.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3g1zx/til_that_there_is_a_scottish_nurse_that_can/"
  },
  {
    "text": "TIL Fresh, sealed meat would be purple. So meat packagers add carbon monoxide to turn it bright red.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b33vwa/til_fresh_sealed_meat_would_be_purple_so_meat/"
  },
  {
    "text": "TIL that our strongest memories are usually widely inaccurate. It feels like memories of traumatic events “burn” themselves into our minds to remain there forever, but studies have shown that the stronger the emotional state you were in during that event, the more inaccurate the memory is.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3c37t/til_that_our_strongest_memories_are_usually/"
  },
  {
    "text": "TIL: In 2007, a British woman with a Brazil nut allergy suffered the first recorded severe allergic reaction transmitted by semen during vaginal intercourse.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3b63x/til_in_2007_a_british_woman_with_a_brazil_nut/"
  },
  {
    "text": "TIL that Steve Irwin paid for one of his security guards to go and train MMA in the USA, that security guard, Kyle Noke, would go on to fight in the UFC and credits Irwin as a major reason why he achieved his dreams.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3hfsr/til_that_steve_irwin_paid_for_one_of_his_security/"
  },
  {
    "text": "TIL: a Pakistani Cafe in Karachi called \"Sattar Buksh\" has a logo that bears some similarities to the Starbucks logo, they sued the small cafe and lost because the logo is significantly different and the name itself has been around for hundreds of years.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3gsq2/til_a_pakistani_cafe_in_karachi_called_sattar/"
  },
  {
    "text": "TIL that the lead singer of Toto, Joseph Williams, is the son of Star Wars/Jaws/Jurassic Park composer John Williams",
    "link": "https://www.reddit.com/r/todayilearned/comments/b2zii5/til_that_the_lead_singer_of_toto_joseph_williams/"
  },
  {
    "text": "TIL players of an online video game called Foldit decoded the crystal structure of an AIDS structure using the video game puzzle that had baffled scientists for over 15 years.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3hcei/til_players_of_an_online_video_game_called_foldit/"
  },
  {
    "text": "TIL that Harvard Law professor Roger Fisher once suggested placing the U.S. nuclear launch codes inside the chest cavity of a volunteer, and \"If ever the president wanted to fire nuclear weapons, the only way he could do so would be for him first, with his own hands, to kill one human being.\"",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3hkqi/til_that_harvard_law_professor_roger_fisher_once/"
  },
  {
    "text": "TIL Bruce Lee's debut film appearance was as a baby girl in a film by an openly lesbian Chinese director in 1941",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3ggnk/til_bruce_lees_debut_film_appearance_was_as_a/"
  },
  {
    "text": "TIL That early dentures were made from ivory, and teeth extracted from human corpses and animals. The battle of Waterloo provided so many quality teeth they were much sought after and named \"Waterloo Teeth\"",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3e2n8/til_that_early_dentures_were_made_from_ivory_and/"
  },
  {
    "text": "TIL About a 50,000 word book that has no words that contain the letter \"E\"",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3flj4/til_about_a_50000_word_book_that_has_no_words/"
  },
  {
    "text": "TIL that, in 1841, the anticipation for the 40th and final installment of Charles Dickens's The Old Curiosity Shop was so great that a mob of Dickens's American fans stormed the wharf in New York and yelled to the ships bearing the resolution of the series, demanding to learn how the story ended.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3f3b3/til_that_in_1841_the_anticipation_for_the_40th/"
  },
  {
    "text": "TIL while filming \"Some Came Running\" in the small town of Madison, IN (1958), Sinatra was \"besieged\" by local women and at one point a woman broke through a rope barrier and flung herself at Sinatra as her husband ran to stop her, pleading \"Helen, you don't even know the man!\"",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3fomw/til_while_filming_some_came_running_in_the_small/"
  },
  {
    "text": "TIL out of the 3 volunteers who went in 1986 on a suicide mission to open the valves of the pool at the Chernobyl plant 2 are actually still alive",
    "link": "https://www.reddit.com/r/todayilearned/comments/b2ygz3/til_out_of_the_3_volunteers_who_went_in_1986_on_a/"
  },
  {
    "text": "TIL there is a species of snail named Crikey steveirwini in honor of Steve Irwin.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3dgid/til_there_is_a_species_of_snail_named_crikey/"
  },
  {
    "text": "TIL that in the weeks before the 1966 24 hours of Le Mans, Ford's team would often take amphetamine pills to fuel their work sessions through the night. Ford went on to win 1st, 2nd, and 3rd, over their arch rival Ferrari, becoming the first Americans ever to win the race.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3bduj/til_that_in_the_weeks_before_the_1966_24_hours_of/"
  },
  {
    "text": "TIL that the biggest volcano we know of in the whole solar system is Olympus Mons located on Mars. This one volcano is the size of the whole state of Arizona.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3bjra/til_that_the_biggest_volcano_we_know_of_in_the/"
  },
  {
    "text": "Today I learned that Calories and calories aren't the same, a capital \"C\" means 1000 calories.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3avz9/today_i_learned_that_calories_and_calories_arent/"
  },
  {
    "text": "TIL about the title \"Righteous Among The Nations\" an honorary status given to those of non Jewish faith who helped or aided people of Jewish faith during World War II. To date over 26,000 people have been honored.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3cblm/til_about_the_title_righteous_among_the_nations/"
  },
  {
    "text": "TIL Daniel Norris who pitches for the Detroit Tigers, lives out of a 1978 Volkswagen van bus despite making millions as a professional athlete.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3c5uu/til_daniel_norris_who_pitches_for_the_detroit/"
  },
  {
    "text": "TIL that Kim Jong-il was credited with amazing achievements by North Korean propaganda, including 11 holes-in-one the first time he played golf, learning to walk at 3 weeks old, and writing 6 operas in 2 years.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3clrv/til_that_kim_jongil_was_credited_with_amazing/"
  },
  {
    "text": "TIL the first US intelligence satellites were equipped with film cameras, and quite literally had to drop canisters of film from space to the Earth, which were intercepted mid-air by pilots over the ocean as early as 1959.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3e7iq/til_the_first_us_intelligence_satellites_were/"
  },
  {
    "text": "TIL Wrestling superstar John Cena has granted wishes for 580 kids through the Make-A-Wish Foundation,more than any other celebrity in history. No one else has even surpassed 300",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3hpc7/til_wrestling_superstar_john_cena_has_granted/"
  },
  {
    "text": "TIL when MCA president Mike Maitland initially refused to pay for an elaborate cover design for Keith Moon's album \"Two Sides of the Moon\", Moon came to his office with a fire axe and asked \"What's it going to be, dear boy? My album cover or a new desk?\".",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3dkoh/til_when_mca_president_mike_maitland_initially/"
  },
  {
    "text": "TIL a \"chain\" is an official imperial unit of measurement equal to 22 yards (66 feet). One chain is the length between the two wickets in the game of cricket. Furthermore, 10 chains equal one furlong, and there are 8 furlongs in 1 mile.",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3ftk3/til_a_chain_is_an_official_imperial_unit_of/"
  },
  {
    "text": "TIL about \"Doctor\" Sebi who still has a large following today who claimed to have found a cure for AIDS, Cancer, Herpes, etc. His \"cure\" was a vegan, alkaline diet. He gave medical advice to Michael Jackson, Steven Seagal, and Eddie Murphy. He was charged by NYC for practicing medicine w/o a license",
    "link": "https://www.reddit.com/r/todayilearned/comments/b3gyt0/til_about_doctor_sebi_who_still_has_a_large/"
  }
]